Tutorial2/Baffled/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 20   0   70)	
    ( 160  0   70)
    ( 160  170   70)
    (20    170   70)
    (20    0   210)
    ( 160  0   210)//155
    ( 160   170  210)
    ( 20   170   210)//y -10 180
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 85 70) simpleGrading (1 1 1)//70 85 70
);

edges
(
);

boundary 
(
    allBoundary
    {
        type patch;
        faces
        (
            
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
	    (3 7 6 2)
	//    (0 4 7 3)
        );
    }

inlet
{
        type patch;
        faces
        (
         (0 4 7 3)   
        );
    }


    outlet 
    {
        type patch;
        faces
        (
          (2 6 5 1)  
        );
    }
);

// ************************************************************************* //
