Tutorial2/Baffled/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform (0 0 0);//$internalField;
    }
    outlet
    {
type               pressureInletOutletVelocity;
       phi                phi.air;
     value              $internalField;
	
 //type               calculated;//zeroGradient;
//value		$internalField;
            }
impeller
    {
type               fixedValue;
        value              uniform (0 0 0);

//        type            noSlip;
            }

    vessel
    {
type               fixedValue;
        value              uniform (0 0 0);

//        type               noSlip;
            }
	baffles
		{
		type               fixedValue;
        	value              uniform (0 0 0);

            }




}

// ************************************************************************* //
