Tutorial2/Baffled/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    
    inlet
    {
        type            fixedValue;
        value           uniform 0.5;
    }
   /* outlet
    {
        type            fixedValue;
        value           uniform 0.5;
    }*/			// comented out to try previous BC
    impeller
    {
        type            zeroGradient;
    }
    vessel
    {
        type            zeroGradient;
    }
	baffles
 {
        type            zeroGradient;
    }


    outlet
    {
        type            inletOutlet;
        phi             phi.water;
        inletValue      uniform 0.5;//was 0
        value           uniform 0.5;// was 0
    }

        
}

// ************************************************************************* //
